In [1]:
import pandas as pd

In [2]:
data = {
    'a': [1,2,3,4],
    'b': [4,5,6,7],
    'c': ["Aryan", "Hitesh", "Piyush", "Krish"],
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a  b       c
0  1  4   Aryan
1  2  5  Hitesh
2  3  6  Piyush
3  4  7   Krish

In [7]:
df.set_index('a', inplace=True)

In [8]:
df

   b       c
a
1  4   Aryan
2  5  Hitesh
3  6  Piyush
4  7   Krish

In [10]:
df.reset_index(inplace=True)

In [11]:
df

   a  b       c
0  1  4   Aryan
1  2  5  Hitesh
2  3  6  Piyush
3  4  7   Krish

In [14]:
df.reindex([2,3,1,0])

   a  b       c
2  3  6  Piyush
3  4  7   Krish
1  2  5  Hitesh
0  1  4   Aryan

In [ ]:
for i,j in df.iterrows():
    print(i)
    print(j)

a        1
b        4
c    Aryan
Name: 0, dtype: object
a         2
b         5
c    Hitesh
Name: 1, dtype: object
a         3
b         6
c    Piyush
Name: 2, dtype: object
a        4
b        7
c    Krish
Name: 3, dtype: object

In [28]:
for i,j,c,e in df.itertuples():
    print(i,j,c,e)

0 1 4 Aryan
1 2 5 Hitesh
2 3 6 Piyush
3 4 7 Krish

In [30]:
[i for i in df['a']]

[1, 2, 3, 4]

In [31]:
list(df['a'])

[1, 2, 3, 4]

In [41]:
def test(s):
    return s.sum()

df.apply(test)

a                        10
b                        22
c    AryanHiteshPiyushKrish
dtype: object